In [1]:
import pandas as pd
import numpy as np
from sqlalchemy import create_engine, select, insert,DECIMAL, Table, Column, PrimaryKeyConstraint, Integer, String, MetaData, ForeignKey, Date

In [3]:
customer = pd.read_excel('/Users/Luqin/Downloads/Grocery_datasets.xlsx', sheet_name='customer')
vendor = pd.read_excel('/Users/Luqin/Downloads/Grocery_datasets.xlsx', sheet_name='vendor')
employee = pd.read_excel('/Users/Luqin/Downloads/Grocery_datasets.xlsx', sheet_name='employee')
customer.head()

,transaction_date,cus_first_name,cus_last_name,cus_email,cus_phone,cus_address,loyalty_points,membership_status,transaction_product,product_price,transaction_quantity,total_price,promotion,transaction_amount,app_name,store_location
0,2023-04-26,Fidelity,Woolaghan,fwoolaghan0@yelp.com,502-165-0460,1 Columbus Point,834,Gold,Strawberry Balsamic Compote,14.8512,24,356.4288,0.0,356.42880,None,queens 1
1,2023-01-26,Gerrie,Benedict,gbenedict1@independent.co.uk,119-945-0412,66922 Hollow Ridge Junction,562,Silver,Organic Sangria Spritzer,23.5021,18,423.0378,0.3,296.12646,None,brooklyn 1
2,2022-09-04,Yul,Lacroutz,ylacroutz2@ask.com,364-903-4843,009 Sauthoff Junction,934,Gold,Clearing Eucalyptus Aromatherapy Mist Clearing...,11.3665,12,136.3980,0.0,136.39800,None,brooklyn 1
3,2023-05-15,Lynne,Trice,ltrice3@state.tx.us,225-966-3211,1 Gerald Terrace,271,Normal,Organic Wakame Strips,16.0965,47,756.5355,0.0,756.53550,None,brooklyn 2
4,2023-03-03,Cynthie,Leggitt,cleggitt4@hibu.com,293-562-0144,3120 Amoth Alley,283,Normal,Original Vegan Soy Taquitos,27.8628,34,947.3352,0.3,663.13464,None,brooklyn 2

In [4]:
vendor.head()

,vendor_name,vendor_contact,vendor_email,vendor_phone,product_category,product_name,product_vendor,stock_level,vendor_name.1,vendor_email.1,vendor_phone.1,delivery_date,delivered_quantity,delivered_total_cost,expiration_date,Unnamed: 15,Unnamed: 16
0,CASA FORCELLO,Charyl St. Ledger,cst0@t-online.de,800-357-2532,pantry_essentials,Strawberry Balsamic Compote,CASA FORCELLO,139,Charyl St. Ledger,cst0@t-online.de,800-357-2532,2022-08-22,68,742.56,2024-05-31,NaN,NaN
1,Santa Cruz Organic,Trudy Malby,tmalby1@microsoft.com,556-319-7964,Beverages,Organic Sangria Spritzer,Santa Cruz Organic,66,Trudy Malby,tmalby1@microsoft.com,556-319-7964,2022-05-08,52,620.36,2024-08-29,NaN,NaN
2,AURA CACIA,Stesha Pascoe,spascoe2@chron.com,649-328-9851,body_care,Clearing Eucalyptus Aromatherapy Mist Clearing...,AURA CACIA,271,Stesha Pascoe,spascoe2@chron.com,649-328-9851,2022-03-10,28,250.60,2023-09-01,NaN,NaN
3,Ocean's Halo,Gibb Wooton,gwooton3@freewebs.com,310-144-8582,pantry_essentials,Organic Wakame Strips,Ocean's Halo,208,Gibb Wooton,gwooton3@freewebs.com,310-144-8582,2022-10-18,51,558.45,2024-07-01,NaN,NaN
4,STARLITE,Ermanno Dunlop,edunlop4@cisco.com,869-529-3545,frozen_foods,Original Vegan Soy Taquitos,STARLITE,243,Ermanno Dunlop,edunlop4@cisco.com,869-529-3545,2022-08-14,50,1123.50,2024-10-08,NaN,NaN

In [5]:
employee.head()

,staff_firstname,staff_lastname,staff_age,staff_email,staff_position,shift_start,shift_end,shift_date,store_name,store_street,store_zip,store_state
0,Damien,Greensitt,18,dgreensitt0@soundcloud.com,Deli Clerk,04:27:00,20:11:00,2022-01-16,brooklyn 1,"3202 Church Ave, Brooklyn",11226,NY
1,Reginald,Forth,34,rforth1@sogou.com,Manager,21:20:00,14:25:00,2023-02-14,brooklyn 2,"2970 Nostrand Ave, Brooklyn",11229,NY
2,Swen,Hakewell,32,shakewell2@nba.com,Produce Clerk,08:55:00,01:04:00,2022-12-19,brooklyn 3,"751 Rogers Ave, Brooklyn",11226,NY
3,Shari,Farnell,41,sfarnell3@edublogs.org,Deli Clerk,03:54:00,03:43:00,2023-01-16,queens 1,"115-50 Merrick Blvd, Jamaica",11434,NY
4,Cristionna,Geere,28,cgeere4@mayoclinic.com,Deli Clerk,17:46:00,07:10:00,2022-10-09,queens 2,"138-48 84th Dr, Jamaica",11435,NY

In [8]:
# Specify the database to connect to
database = 'postgresql://postgres:1234@localhost:5432/g10'
# Create an engine that connects to PostgreSQL server
engine = create_engine(database)
# Establish a connection
connection = engine.connect()

In [9]:
# Pass the SQL statements that create all tables
from sqlalchemy import text

# SQL statements to create tables, with modifications based on schema validation
sql_statements = [
    """
    CREATE TABLE stores (
        location_id SERIAL PRIMARY KEY,
        store_name VARCHAR(100),
        store_street VARCHAR(100),
        store_state VARCHAR(50),
        store_zip VARCHAR(10)
    );
    """,
    """
    CREATE TABLE Vendors (
        vendor_id SERIAL PRIMARY KEY,
        vendor_name VARCHAR(100),
        vendor_contact VARCHAR(100),
        vendor_email VARCHAR(100),
        vendor_phone VARCHAR(20)
    );
    """,
    """
    CREATE TABLE Staffs (
        staff_id SERIAL PRIMARY KEY,
        staff_firstname VARCHAR(50),
        staff_lastname VARCHAR(50),
        staff_age INT,
        staff_email VARCHAR(100),
        staff_position VARCHAR(50),
        shift_start TIME,
        shift_end TIME,
        shift_date DATE,
        store_id INTEGER REFERENCES stores(location_id)
    );
    """,
    """
    CREATE TABLE Categories (
        category_id SERIAL PRIMARY KEY,
        product_category VARCHAR(50)
    );
    """,
    """
    CREATE TABLE Inventories (
        product_id SERIAL PRIMARY KEY,
        product_name VARCHAR(255),
        product_category VARCHAR(255),
        stock_level INT,
        expiration_date DATE,
        product_vendor VARCHAR(255)
    );
    """,
    """
    CREATE TABLE Promotions (
        promotion_id SERIAL PRIMARY KEY,
        promotion VARCHAR(100)
    );
    """,
    """
    CREATE TABLE Customers (
        customer_id SERIAL PRIMARY KEY,
        cus_first_name VARCHAR(50),
        cus_last_name VARCHAR(50),
        cus_email VARCHAR(100),
        cus_address VARCHAR(255),
        cus_phone VARCHAR(20),
        membership_status VARCHAR(50),
        location_id INT REFERENCES stores(location_id)
    );
    """,
    """
    CREATE TABLE In_store_transactions (
        transaction_id SERIAL PRIMARY KEY,
        customer_id INT REFERENCES Customers (customer_id),
        transaction_amount DECIMAL(10, 2),
        transaction_date DATE,
        transaction_product VARCHAR(255),
        location_id INT REFERENCES stores(location_id)
    );
    """,
    """
    CREATE TABLE Delivery_Apps (
        app_id SERIAL PRIMARY KEY,
        app_name VARCHAR(100)
    );
    """,
    """
    CREATE TABLE Customer_Delivery_Transactions (
        delivery_transaction_id SERIAL PRIMARY KEY,
        cus_email VARCHAR(100),
        app_name VARCHAR (100),
        transaction_amount DECIMAL(10, 2),
        transaction_date DATE
    );
    """,
    """
    CREATE TABLE Customer_Delivery_Transaction_Details (
        delivery_transaction_id SERIAL PRIMARY KEY,
        transaction_product VARCHAR(255),
        product_category VARCHAR(50),
        transaction_quantity INT,
        transaction_amount DECIMAL(10, 2),
        transaction_date DATE,
        promotion VARCHAR(100),
        category_id INT REFERENCES Categories(category_id),
        product_id INT REFERENCES Inventories(product_id)
    );

    """,
    """
    CREATE TABLE Sup_deliveries (
        delivery_id SERIAL PRIMARY KEY,
        product_name VARCHAR(255),
        delivery_date DATE
    );
    """,
    """
    CREATE TABLE Sup_deliveries_cost (
        transaction_id SERIAL PRIMARY KEY,
        delivery_quantity INT,
        product_cost DECIMAL(10, 2),
        delivery_total_cost DECIMAL(10, 2),
        product_id INT REFERENCES Inventories(product_id)
    );
    """,
    """
    CREATE TABLE Product_Vendor_Relationships (
        product_vendor_id SERIAL PRIMARY KEY,
        product_id INT REFERENCES Inventories(product_id),
        vendor_id INT REFERENCES Vendors(vendor_id)
    );
    """,
    """
    CREATE TABLE Customer_Membership_Status (
        membership_status_id SERIAL PRIMARY KEY,
        membership_name VARCHAR(50),
        loyalty_points INT
    );
    """
]

# Execute each SQL statement
for statement in sql_statements:
    connection.execute(text(statement))

# Return a message indicating that tables have been created
"Tables created successfully in the database."

'Tables created successfully in the database.'

In [10]:
#TABLE 1: stores

# Extracting unique store information from the employee dataframe
stores_df = employee[['store_name', 'store_street', 'store_zip', 'store_state']].drop_duplicates()
#check the uniqueness of vendor
num_duplicates = stores_df.duplicated().sum()
num_duplicates
#create id for each unique value
stores_df.insert(0, 'location_id', range(1, 1 + len(stores_df)))
stores_df.head()
new_row = pd.DataFrame({
    'location_id': [6],
    'store_name': ['Online'],
    'store_street': ['none'],
    'store_zip': ['none'],
    'store_state': ['none']
})

# Concatenate the original DataFrame with the new row DataFrame
stores_df = pd.concat([stores_df, new_row], ignore_index=True)

# Load the transformed stores dataframe into the storee table
stores_df.to_sql('stores', connection, if_exists='append', index=False)
stores_df.head(6)

   location_id  store_name                  store_street store_zip store_state
0            1  brooklyn 1     3202 Church Ave, Brooklyn     11226          NY
1            2  brooklyn 2   2970 Nostrand Ave, Brooklyn     11229          NY
2            3  brooklyn 3      751 Rogers Ave, Brooklyn     11226          NY
3            4    queens 1  115-50 Merrick Blvd, Jamaica     11434          NY
4            5    queens 2       138-48 84th Dr, Jamaica     11435          NY
5            6      Online                          none      none        none

In [11]:
#TABLE 2: Vendors

# Extracting unique vendor information from the vendor dataframe
vendors_df = vendor[['vendor_name', 'vendor_contact', 'vendor_email', 'vendor_phone']].drop_duplicates()
#create id for each unique value
vendors_df.insert(0, 'vendor_id', range(1, 1 + len(vendors_df)))
vendors_df.head()
# Load the transformed Vendors dataframe into the Vendors table
vendors_df.to_sql('Vendors', connection, if_exists='append', index=False)
vendors_df.head()

,vendor_id,vendor_name,vendor_contact,vendor_email,vendor_phone
0,1,CASA FORCELLO,Charyl St. Ledger,cst0@t-online.de,800-357-2532
1,2,Santa Cruz Organic,Trudy Malby,tmalby1@microsoft.com,556-319-7964
2,3,AURA CACIA,Stesha Pascoe,spascoe2@chron.com,649-328-9851
3,4,Ocean's Halo,Gibb Wooton,gwooton3@freewebs.com,310-144-8582
4,5,STARLITE,Ermanno Dunlop,edunlop4@cisco.com,869-529-3545

In [12]:
#TABLE 3: Staffs

# Extracting staff-related information from the employee dataframe
staffs_df = employee[['staff_firstname', 'staff_lastname', 'staff_age', 'staff_email', 'staff_position', 'shift_start', 'shift_end', 'shift_date', 'store_name']].copy()

# Fetching mapping of store_name to location_id from the database
store_mapping = pd.read_sql('SELECT location_id, store_name FROM stores', connection)
store_mapping_dict = store_mapping.set_index('store_name').to_dict()['location_id']

# Mapping store_name to location_id in the staffs_transformed dataframe
staffs_df['store_id'] = staffs_df['store_name'].map(store_mapping_dict)
staffs_df.drop(columns=['store_name'], inplace=True)

#create id for each unique value
staffs_df.insert(0, 'staff_id', range(1, 1 + len(staffs_df)))
staffs_df.head()
# Load the transformed Staffs dataframe into the Staffs table
staffs_df.to_sql('Staffs', connection, if_exists='append', index=False)
staffs_df.head()

,staff_id,staff_firstname,staff_lastname,staff_age,staff_email,staff_position,shift_start,shift_end,shift_date,store_id
0,1,Damien,Greensitt,18,dgreensitt0@soundcloud.com,Deli Clerk,04:27:00,20:11:00,2022-01-16,1
1,2,Reginald,Forth,34,rforth1@sogou.com,Manager,21:20:00,14:25:00,2023-02-14,2
2,3,Swen,Hakewell,32,shakewell2@nba.com,Produce Clerk,08:55:00,01:04:00,2022-12-19,3
3,4,Shari,Farnell,41,sfarnell3@edublogs.org,Deli Clerk,03:54:00,03:43:00,2023-01-16,4
4,5,Cristionna,Geere,28,cgeere4@mayoclinic.com,Deli Clerk,17:46:00,07:10:00,2022-10-09,5

In [13]:
#TABLE 4: Categories

# Extracting unique product categories from the vendor dataframe
categories_df = vendor['product_category'].drop_duplicates().reset_index(drop=True).to_frame()
#create id for each unique value
categories_df.insert(0, 'category_id', range(1, 1 + len(categories_df)))
# Load the transformed Categories dataframe into the Categories table
categories_df.to_sql('Categories', connection, if_exists='append', index=False)
categories_df.head()

   category_id   product_category
0            1  pantry_essentials
1            2          Beverages
2            3          body_care
3            4       frozen_foods
4            5            produce

In [14]:
#TABLE 5: Inventories

# Extracting required columns for the Inventories table from the 'vendor' dataframe
inventories_df = vendor[['product_name', 'stock_level', 'expiration_date', 'product_category', 'product_vendor']].copy()

# Removing duplicates
inventories_df.drop_duplicates(inplace=True)
inventories_df.head()

#create id for each unique value
inventories_df.insert(0, 'product_id', range(1, 1 + len(inventories_df)))

# Inserting the data into the Inventories table
inventories_df.to_sql('Inventories', connection, if_exists='append', index=False)
inventories_df.head()

,product_id,product_name,stock_level,expiration_date,product_category,product_vendor
0,1,Strawberry Balsamic Compote,139,2024-05-31,pantry_essentials,CASA FORCELLO
1,2,Organic Sangria Spritzer,66,2024-08-29,Beverages,Santa Cruz Organic
2,3,Clearing Eucalyptus Aromatherapy Mist Clearing...,271,2023-09-01,body_care,AURA CACIA
3,4,Organic Wakame Strips,208,2024-07-01,pantry_essentials,Ocean's Halo
4,5,Original Vegan Soy Taquitos,243,2024-10-08,frozen_foods,STARLITE

In [15]:
#TABLE 6: Promotions

# Extract promotions data from customer dataframe
promotions_df = customer[['promotion']].drop_duplicates().reset_index(drop=True)

# Rename columns to match the database schema
promotions_df.columns = ['promotion']

# Transformation: Exclude NaN or missing values
promotions_df = promotions_df.dropna()

#create id for each unique value
promotions_df.insert(0, 'promotion_id', range(1, 1 + len(promotions_df)))
# Load promotions data into the database
promotions_df.to_sql('Promotions', connection, if_exists='append', index=False, method='multi')
promotions_df.head()

   promotion_id  promotion
0             1        0.0
1             2        0.3
2             3        0.1

In [16]:
#TABLE 7: Customers

# Extracting necessary columns from customer dataframe
customers_df = customer[['cus_first_name', 'cus_last_name', 'cus_email', 'cus_address', 'cus_phone', 'membership_status', 'store_location']].drop_duplicates()
customers_df.count()
customers_df.head()

#rename the column name 
customers_df.rename(columns={'store_location': 'store_name'}, inplace=True)
temp_cus_df= pd.merge(customers_df, stores_df, on='store_name')
temp_cus_df.head()

#drop variables
temp_cus_df.drop(['store_street', 'store_name','store_zip','store_state'], axis=1, inplace=True)
customers_df=temp_cus_df
customers_df.insert(0, 'customer_id', range(1, 1 + len(customers_df)))
customers_df.head()
# Load data into the database
customers_df.to_sql('Customers', connection, if_exists='append', index=False, method='multi')
customers_df.head()

,customer_id,cus_first_name,cus_last_name,cus_email,cus_address,cus_phone,membership_status,location_id
0,1,Fidelity,Woolaghan,fwoolaghan0@yelp.com,1 Columbus Point,502-165-0460,Gold,4
1,2,Meredeth,Burras,mburrasa@cnn.com,7768 Coleman Place,999-876-4976,Normal,4
2,3,Orel,Cheal,ochealk@zimbio.com,26516 Chive Crossing,267-837-0618,Gold,4
3,4,Noll,Dorton,ndortonl@cornell.edu,4 Sage Way,785-824-7715,Normal,4
4,5,Alis,Findley,afindleym@list-manage.com,091 Weeping Birch Place,128-794-8353,Silver,4

In [17]:
#TABLE 8: In Store Transactions

# Extracting required columns for the In_store_transactions table from the 'customer' dataframe
instore_trans_df = customer[customer['app_name'] == 'None'][['transaction_date', 'product_price', 'transaction_quantity', 'promotion', 'transaction_amount', 'store_location', 'cus_phone']].copy()
#rename the column name 
instore_trans_df.rename(columns={'store_location': 'store_name'}, inplace=True)
temp_instore_df= pd.merge(instore_trans_df, stores_df, on='store_name')
#drop variables
temp_instore_df.drop(['store_street', 'store_name','store_zip','store_state'], axis=1, inplace=True)
temp_instore_df= pd.merge(instore_trans_df, customers_df, on='cus_phone')
temp_instore_df.drop(['cus_phone', 'store_name','cus_email','cus_last_name','cus_first_name','membership_status','cus_address'], axis=1, inplace=True)
instore_trans_df=temp_instore_df
# Load data into the database
instore_trans_df.to_sql('In_store_transactions', connection, if_exists='append', index=False, method='multi')
instore_trans_df.head()

,transaction_date,product_price,transaction_quantity,promotion,transaction_amount,customer_id,location_id
0,2023-04-26,14.8512,24,0.0,356.42880,1,4
1,2023-01-26,23.5021,18,0.3,296.12646,104,1
2,2022-09-04,11.3665,12,0.0,136.39800,105,1
3,2023-05-15,16.0965,47,0.0,756.53550,207,2
4,2023-03-03,27.8628,34,0.3,663.13464,208,2

In [18]:
#TABLE 9: Delivery Apps

# Extract unique app names from the customer dataframe where app_name is not 'None'
delivery_apps_df = customer[customer['app_name'] != 'None']['app_name'].drop_duplicates()
# Create a DataFrame from the unique app names
delivery_apps_df = pd.DataFrame(delivery_apps_df, columns=['app_name'])
#create id for each unique value
delivery_apps_df.insert(0, 'app_id', range(1, 1 + len(delivery_apps_df)))
# Load the DataFrame into the Delivery_Apps table
delivery_apps_df.to_sql('Delivery_Apps', connection, if_exists='append', index=False)
delivery_apps_df.head()

     app_id   app_name
464       1  Instacart
469       2   Doordash
471       3  Uber Eats

In [19]:
#TABLE 10: Customer Delivery Transactions

# Extracting required columns for the Customer_Delivery_Transactions table from the 'customer' dataframe
Customer_Delivery_Transactions = customer[['cus_phone','app_name','transaction_amount','promotion', 'transaction_date']].copy()
Customer_Delivery_Transactions = Customer_Delivery_Transactions[Customer_Delivery_Transactions['app_name'] != 'None']
temp_cusdel_df= pd.merge(Customer_Delivery_Transactions, delivery_apps_df, on='app_name')
#drop variables
temp_cusdel_df.drop(['app_name'], axis=1, inplace=True)
temp_cusdel_df= pd.merge(temp_cusdel_df, customers_df, on='cus_phone')
temp_cusdel_df.drop(['location_id','cus_phone','cus_email','cus_last_name','cus_first_name','membership_status','cus_address'], axis=1, inplace=True)
Customer_Delivery_Transactions =temp_cusdel_df
Customer_Delivery_Transactions.head()
# Add delivery_transaction_id column
Customer_Delivery_Transactions.insert(0, 'delivery_transaction_id', range(1, 1+len(Customer_Delivery_Transactions)))
# Load data into the database
Customer_Delivery_Transactions.to_sql('Customer_Delivery_Transactions', connection, if_exists='append', index=False, method='multi')
Customer_Delivery_Transactions.head()

,delivery_transaction_id,transaction_amount,promotion,transaction_date,app_id,customer_id
0,1,952.3150,0.3,2023-02-11,1,465
1,2,49.5132,0.0,2022-12-07,1,466
2,3,1170.5904,0.0,2023-05-11,1,467
3,4,803.0395,0.0,2023-01-23,1,468
4,5,210.4200,0.3,2023-01-28,1,469

In [20]:
#TABLE 11: Customer Delivery Transaction Details

delivery_customers = customer[customer['app_name'] != 'None']

#Extracting required columns for the Customer_Delivery_Transaction_Details table from the 'vendor' dataframe
Customer_Delivery_Transaction_Details = delivery_customers[['transaction_product','transaction_quantity','transaction_date','transaction_amount', 'promotion']].copy()
Customer_Delivery_Transaction_Details.rename(columns={'transaction_product': 'product_name'}, inplace=True)
temp_cusdeltra_df= pd.merge(Customer_Delivery_Transaction_Details, inventories_df, on='product_name')
#drop variables
temp_cusdeltra_df.drop(['product_name','stock_level','expiration_date','product_vendor'], axis=1, inplace=True)
temp_cusdeltra_df= pd.merge(temp_cusdeltra_df, categories_df, on='product_category')
temp_cusdeltra_df.drop(['product_category'], axis=1, inplace=True)
temp_cusdeltra_df.head()

# Add delivery_transaction_id column
temp_cusdeltra_df.insert(0, 'delivery_transaction_id', range(1, 1+len(temp_cusdeltra_df)))
temp_cusdeltra_df.head()

# Load data into the database
temp_cusdeltra_df.to_sql('Customer_Delivery_Transaction_Details ', connection, if_exists='append', index=False, method='multi')
temp_cusdeltra_df.head()

,delivery_transaction_id,transaction_quantity,transaction_date,transaction_amount,promotion,product_id,category_id
0,1,20,2023-02-11,952.31500,0.3,465,4
1,2,12,2023-01-28,210.42000,0.3,469,4
2,3,23,2022-10-09,125.13564,0.3,472,4
3,4,34,2022-10-25,774.50436,0.3,481,4
4,5,16,2022-10-29,552.48928,0.3,482,4

In [25]:
#TABLE 12: Suppliers Delivery

# Extracting unique product categories from the vendor dataframe
sup_deliveries_transformed = vendor[['product_name','delivery_date']].drop_duplicates()
#meger and drop
temp_sup_df= pd.merge(sup_deliveries_transformed, inventories_df, on='product_name')
temp_sup_df.drop(['product_name', 'stock_level','expiration_date','product_category','product_vendor'], axis=1, inplace=True)
#create id for each unique value
sup_deliveries_df.insert(0, "delivery_id", range(1, 1 + len(sup_deliveries_transformed)))
sup_deliveries_df.head()

# Load data into the database
sup_deliveries_df.to_sql('Sup_deliveries', connection, if_exists='append', index=False, method='multi')
sup_deliveries_df.head()

,delivery_id,product_name,delivery_date
0,1,Strawberry Balsamic Compote,2022-08-22
1,2,Organic Sangria Spritzer,2022-05-08
2,3,Clearing Eucalyptus Aromatherapy Mist Clearing...,2022-03-10
3,4,Organic Wakame Strips,2022-10-18
4,5,Original Vegan Soy Taquitos,2022-08-14

In [22]:
#Table 13:Sup Transactions Detials

# Extracting required columns for the Sup_deliveries_details table from the 'vendor' dataframe
Sup_deliveries_details = vendor[['delivery_date','product_name','product_category','delivered_quantity','delivered_total_cost']].copy()

# Mapping delivery_date to delivery_id
Sup_deliveries_details.head()
temp_supdel_df= pd.merge(Sup_deliveries_details, inventories_df, on='product_name')
temp_supdel_df.head()
temp_supdel_df.drop(['product_name','stock_level','expiration_date','product_vendor'], axis=1, inplace=True)
temp_supdel_df.drop(['product_category_y'], axis=1, inplace=True)
temp_supdel_df.drop(['product_category_x','delivery_date'], axis=1, inplace=True)
temp_supdel_df['product_cost'] = temp_supdel_df['delivered_total_cost'] / temp_supdel_df['delivered_quantity'].round(2)

temp_supdel_df.insert(0, 'transaction_id', range(1, 1 + len(temp_supdel_df)))
temp_supdel_df.head()
# Load data into the database
temp_supdel_df.to_sql('Sup_deliveries_cost', connection, if_exists='append', index=False, method='multi')
temp_supdel_df.head()

,transaction_id,delivered_quantity,delivered_total_cost,product_id,product_cost
0,1,68,742.56,1,10.92
1,2,52,620.36,2,11.93
2,3,28,250.60,3,8.95
3,4,51,558.45,4,10.95
4,5,50,1123.50,5,22.47

In [23]:
#Table 14: Vendors Product Relationship

vedor_rela = vendor[['product_name','product_vendor']].drop_duplicates()
vedor_rela.head()
#rename the column name 
vedor_rela.rename(columns={'product_vendor': 'vendor_name'}, inplace=True)
vedor_rela= pd.merge(vedor_rela, vendors_df, on='vendor_name')
vedor_rela.drop(['vendor_name','vendor_contact','vendor_email','vendor_phone'], axis=1, inplace=True)
vedor_rela= pd.merge(vedor_rela,inventories_df , on='product_name')
vedor_rela.drop(['product_name','stock_level','expiration_date','product_category','product_vendor'], axis=1, inplace=True)
#create id for each unique value
vedor_rela.insert(0, 'product_vendor_id', range(1, 1 + len(vedor_rela)))
vedor_rela.head()

# Load data into Customer_Membership_Status table
vedor_rela.to_sql('Product_Vendor_Relationships', con=connection, if_exists='append', index=False)
vedor_rela.head()

   product_vendor_id  vendor_id  product_id
0                  1          1           1
1                  2          1         126
2                  3          2           2
3                  4          2         127
4                  5          2         748

In [24]:
#Table 15: Memebership Status

# Extract unique membership status and points from customer dataframe
membership_df = customer[['membership_status', 'loyalty_points']]
# Add membership_status_id column
membership_df.insert(0, 'membership_status_id', range(1, 1+len(membership_df)))
# Load data into Customer_Membership_Status table
membership_df.to_sql('Customer_Membership_Status', con=connection, if_exists='append', index=False)
membership_df.head()

   membership_status_id membership_status  loyalty_points
0                     1              Gold             834
1                     2            Silver             562
2                     3              Gold             934
3                     4            Normal             271
4                     5            Normal             283

In [ ]:
#Total Sales by Location: Calculate the total sales made at each store location to identify the most profitable and least performing stores.

# SQL query to calculate total in-store sales by location
total_in_store_sales_query = """
SELECT
    s.location_id,
    s.store_name,
    SUM(ist.transaction_amount) AS total_in_store_sales
FROM Stores AS s
LEFT JOIN In_store_transactions AS ist ON s.location_id = ist.location_id
GROUP BY s.location_id, s.store_name
ORDER BY total_in_store_sales DESC;
"""

# Execute the SQL query and fetch the results into a DataFrame
result = engine.execute(text(total_in_store_sales_query))
total_in_store_sales = pd.DataFrame(result.fetchall(), columns=result.keys())

# Print the DataFrame
print(total_in_store_sales)

# Close the database connection
engine.dispose()

In [ ]:
#Identifies products that have expired or are about to expire.

expired_products_query = """
SELECT
    i.product_name,
    i.expiration_date,
    CASE WHEN i.expiration_date < CURRENT_DATE THEN 'Expired'
         WHEN i.expiration_date >= CURRENT_DATE AND i.expiration_date <= CURRENT_DATE + INTERVAL '7 days' THEN 'Expiring Soon'
         ELSE 'Not Expired' END AS expiration_status
FROM Inventories AS i;
"""
# Execute the SQL query and fetch the results into a DataFrame
result = engine.execute(text(expired_products_query))
expired_products = pd.DataFrame(result.fetchall(), columns=result.keys())

# Print the DataFrame
print(expired_products)

# Close the database connection
engine.dispose()

In [ ]:
#Which product categories have the highest stock levels?

products_stock_query = """
SELECT product_category, SUM(stock_level) AS total_stock
FROM Inventories
GROUP BY product_category
ORDER BY total_stock DESC;
"""
# Execute the SQL query and fetch the results into a DataFrame
result = engine.execute(text(products_stock_query))
products_stock = pd.DataFrame(result.fetchall(), columns=result.keys())

# Print the DataFrame
print(products_stock)

# Close the database connection
engine.dispose()

In [ ]:
#How many products have been sold in each store location?

total_products_each_store_query = """
SELECT s.store_name, COUNT(*) AS total_products_sold
FROM stores s
JOIN In_store_transactions ist ON s.location_id = ist.location_id
GROUP BY s.store_name;
"""

# Execute the SQL query and fetch the results into a DataFrame
result = engine.execute(text(total_products_each_store_query))
total_products_each_store = pd.DataFrame(result.fetchall(), columns=result.keys())

# Print the DataFrame
print(total_products_each_store)

# Close the database connection
engine.dispose()

In [ ]:
#What is the average loyalty points for each membership status?

avg_points_membership_query = """
SELECT membership_status, AVG(loyalty_points) AS avg_loyalty_points
FROM Customer_Membership_Status
GROUP BY membership_status;
"""

# Execute the SQL query and fetch the results into a DataFrame
result = engine.execute(text(avg_points_membership_query))
avg_points_membership = pd.DataFrame(result.fetchall(), columns=result.keys())

# Print the DataFrame
print(avg_points_membership)

# Close the database connection
engine.dispose()

In [ ]:
#How many deliveries were made on each day?

del_daily_query = """
SELECT delivery_date, COUNT(*) AS total_deliveries
FROM Sup_deliveries
GROUP BY delivery_date;
"""

# Execute the SQL query and fetch the results into a DataFrame
result = engine.execute(text(del_daily_query))
del_daily = pd.DataFrame(result.fetchall(), columns=result.keys())

# Print the DataFrame
print(del_daily)

# Close the database connection
engine.dispose()

In [ ]:
#Average Transaction Amount by Store Location and Membership Status:
#What is the average transaction amount for each membership status at each store location?

store_sales_membership_query = """
SELECT
    s.location_id,
    s.store_name,
    c.membership_status,
    AVG(ist.transaction_amount) AS avg_transaction_amount
FROM
    stores AS s
JOIN
    In_store_transactions AS ist ON s.location_id = ist.location_id
JOIN
    Customers AS c ON ist.customer_id = c.customer_id
GROUP BY
    s.location_id, s.store_name, c.membership_status
ORDER BY
    s.location_id, s.store_name, c.membership_status;
"""

# Execute the SQL query and fetch the results into a DataFrame
result = engine.execute(text(store_sales_membership_query))
store_sales_membership = pd.DataFrame(result.fetchall(), columns=result.keys())

# Print the DataFrame
print(store_sales_membership)

# Close the database connection
engine.dispose()

In [ ]:
#Monthly Sales Trend:

monthly_sales_trend_query = """
SELECT EXTRACT(MONTH FROM it.transaction_date) AS transaction_month,
       EXTRACT(YEAR FROM it.transaction_date) AS transaction_year,
       SUM(it.transaction_amount) AS total_sales
FROM In_store_transactions AS it
GROUP BY transaction_month, transaction_year
ORDER BY transaction_year, transaction_month;
"""

# Execute the SQL query and fetch the results into a DataFrame
result = engine.execute(text(monthly_sales_trend_query))
monthly_sales_trend = pd.DataFrame(result.fetchall(), columns=result.keys())

# Print the DataFrame
print(monthly_sales_trend)

# Close the database connection
engine.dispose()

In [ ]:
#Monthly Customer Spending:

monthly_customer_spending_query = """
SELECT EXTRACT(MONTH FROM it.transaction_date) AS transaction_month,
       EXTRACT(YEAR FROM it.transaction_date) AS transaction_year,
       c.cus_first_name, c.cus_last_name, SUM(it.transaction_amount) AS total_spent
FROM Customers AS c
JOIN In_store_transactions AS it ON c.customer_id = it.customer_id
GROUP BY transaction_month, transaction_year, c.cus_first_name, c.cus_last_name
ORDER BY transaction_year, transaction_month, total_spent DESC;
"""

# Execute the SQL query and fetch the results into a DataFrame
result = engine.execute(text(monthly_customer_spending_query))
monthly_customer_spending = pd.DataFrame(result.fetchall(), columns=result.keys())

# Print the DataFrame
print(monthly_customer_spending)

# Close the database connection
engine.dispose()

In [ ]:
#Customer Lifetime Value (CLV):

clv_query = """
WITH customer_lifetime_value AS (
    SELECT c.customer_id, c.cus_first_name, c.cus_last_name,
           SUM(it.transaction_amount) AS total_spent
    FROM Customers AS c
    JOIN In_store_transactions AS it ON c.customer_id = it.customer_id
    GROUP BY c.customer_id
)
SELECT cus_first_name, cus_last_name, total_spent,
       total_spent / (SELECT AVG(total_spent) FROM customer_lifetime_value) AS clv_multiplier
FROM customer_lifetime_value
ORDER BY total_spent DESC;
"""

# Execute the SQL query and fetch the results into a DataFrame
result = engine.execute(text(clv_query))
clv = pd.DataFrame(result.fetchall(), columns=result.keys())

# Print the DataFrame
print(clv)

# Close the database connection
engine.dispose()

In [ ]:
#Customer Churn Analysis:

customer_churn_query = """
WITH customer_churn AS (
    SELECT c.customer_id, c.cus_first_name, c.cus_last_name,
           COUNT(it.transaction_id) AS total_transactions
    FROM Customers AS c
    LEFT JOIN In_store_transactions AS it ON c.customer_id = it.customer_id
    GROUP BY c.customer_id
)
SELECT cus_first_name, cus_last_name, total_transactions,
       CASE
           WHEN total_transactions <= 5 THEN 'Low'
           WHEN total_transactions <= 10 THEN 'Medium'
           ELSE 'High'
       END AS churn_risk
FROM customer_churn
ORDER BY total_transactions DESC;
"""

# Execute the SQL query and fetch the results into a DataFrame
result = engine.execute(text(customer_churn_query))
customer_churn = pd.DataFrame(result.fetchall(), columns=result.keys())

# Print the DataFrame
print(customer_churn)

# Close the database connection
engine.dispose()

In [ ]:
#Store Performance Over Time

store_performance_query = """
SELECT s.store_name, DATE_PART('year', it.transaction_date) AS transaction_year,
       SUM(it.transaction_amount) AS total_sales
FROM stores AS s
JOIN In_store_transactions AS it ON s.location_id = it.location_id
GROUP BY s.store_name, transaction_year
ORDER BY transaction_year, total_sales DESC;
"""

# Execute the SQL query and fetch the results into a DataFrame
result = engine.execute(text(store_performance_query))
store_performance = pd.DataFrame(result.fetchall(), columns=result.keys())

# Print the DataFrame
print(store_performance)

# Close the database connection
engine.dispose()